testSuite/incompressible/pitzDaily3d/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

setFormat raw;

surfaceFormat vtk;

formatOptions
{
}

interpolationScheme cellPoint;

fields
(
    k
    nut
);

sets
(
    horisontalTop
    {
        type        midPoint;
        axis        xyz;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.0 0.0253 0.00001);
        end         (0.2 0.0253 0.00001);
    }

    horisontal
    {
        type        midPoint;
        axis        xyz;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.0 0.0 0.00001);
        end         (0.2 0.0 0.00001);
    }

    vertical
    {
        type        midPoint;
        axis        xyz;

        //- cavity
        start       (0.1 -0.0250001 0.00001);
        end         (0.1 0.0250001 0.00001);
    }
);


surfaces
(
);


// *********************************************************************** //
